#Pandas
Permite tener todas las ventajas de excel en python

In [1]:
#pip install pandas (consola)
#Tratamniento de datos (comento para que uso estas lib)
import numpy as np
import pandas as pd
#-----------------------
pd.set_option('display.max_columns',None) #limite para 4 columnas
pd.set_option('display.max_rows',10) #limite para 10 filas

In [2]:
print(pd.__version__)

2.2.2

#>>Series
Estructura unidimensional (Filas o columnas de datos)

-- **Homogeneos**: 1 tipo de datos por serie.

-- **Elementos ordenados**: cada elemento tiene asociado un índice.

-- **Funcionalidades adicionales**: operaciones mates, filtrar datos, ordenar datos, etc.

##Creacion Serie


*   Serie vacía

In [3]:
#llamar a la libreria vacia, llamo panda o escribo el alias.
serie_vacia = pd.Series()
serie_vacia

Series([], dtype: object)

* Array unidimensional, otro tipo de serie

In [4]:
#para ello debo importar numpy, eso va siempre arriba
array_1 = np.array(range(30,45))
print(array_1)
#genero serie
serie_array = pd.Series(array_1)
serie_array

[30 31 32 33 34 35 36 37 38 39 40 41 42 43 44]

0     30
1     31
2     32
3     33
4     34
      ..
10    40
11    41
12    42
13    43
14    44
Length: 15, dtype: int32

* Lista

In [5]:
lista_num = [3,4,5,6,3,8,5,3,4,5,6,5,3,3,4,5]
serie_lista = pd.Series(lista_num)
serie_lista

0     3
1     4
2     5
3     6
4     3
     ..
11    5
12    3
13    3
14    4
15    5
Length: 16, dtype: int64

* Diccionario

In [6]:
poblacion_pais = {'China' : 1411,
                  'India' : 1367,
                  'Estados Unidos' : 328,
                  'Indonesia' : 264,
                  'Pakistan' : 233,
                  'Brasil' : 212,
                  'Nigeria' : 206,
                  'Bangladesh' : 164,
                  'Rusia' : 145,
                  'Mexico' : 128}

In [7]:
serie_poblacion = pd.Series(poblacion_pais)
serie_poblacion

China             1411
India             1367
Estados Unidos     328
Indonesia          264
Pakistan           233
Brasil             212
Nigeria            206
Bangladesh         164
Rusia              145
Mexico             128
dtype: int64

###Indexación series
- Posición

In [8]:
#print(serie_lista)
print(serie_lista[9])
print(serie_lista[0])
print(serie_lista[0:5])

5
3
0    3
1    4
2    5
3    6
4    3
dtype: int64

* Etiqueta

In [9]:
serie_poblacion

China             1411
India             1367
Estados Unidos     328
Indonesia          264
Pakistan           233
Brasil             212
Nigeria            206
Bangladesh         164
Rusia              145
Mexico             128
dtype: int64

In [10]:
serie_poblacion['Bangladesh']

164

In [11]:
lista_indices = ['Brasil', 'Rusia', 'Estados Unidos']
serie_poblacion[lista_indices]

Brasil            212
Rusia             145
Estados Unidos    328
dtype: int64


---

#>>DataFrames
Conjunto de filas o columnas de datos, una Tabla

-- Para crear dataframe => pd.DataFrame('data','indices(o)','columnas(o)')

* Diccionario

In [12]:
datos_paises = {
    'País':['China','India','Estados Unidos','Indonesia','Pakistan','Brasil','Nigeria','Bangladesh','Rusia','Mexico'],
    'Poblacion (millones)':[1411,1367,328,264,233,212,206,164,145,128],
    'Continente':['Asia','Asia','Norteamerica','Asia','Asia','America','Africa','Asia','Europa','America'],
    'PIB (Billones USD)': [17.73, 3.17, 23.32, 1.19, 0.35, 1.83, 0.45, 0.32, 1.71, 1.27]
}

In [13]:
#cuento cuantos tengo
len(datos_paises['País'])

10

In [14]:
df = pd.DataFrame(datos_paises)
df

             País  Poblacion (millones)    Continente  PIB (Billones USD)
0           China                  1411          Asia               17.73
1           India                  1367          Asia                3.17
2  Estados Unidos                   328  Norteamerica               23.32
3       Indonesia                   264          Asia                1.19
4        Pakistan                   233          Asia                0.35
5          Brasil                   212       America                1.83
6         Nigeria                   206        Africa                0.45
7      Bangladesh                   164          Asia                0.32
8           Rusia                   145        Europa                1.71
9          Mexico                   128       America                1.27

* arrays

In [15]:
datos_paises = np.array([
    ['China', 1411, 'Asia', 17.73],
    ['India', 1367, 'Asia', 3.17],
    ['Estados Unidos', 331, 'America', 23.32],
    ['Indonesia', 264, 'Asia', 1.19],
    ['Pakistan', 233, 'Asia', 0.35],
    ['Brasil', 212, 'America', 1.83],
    ['Nigeria', 206, 'Africa', 0.45],
    ['Bangladesh', 164, 'Asia', 0.32],
    ['Rusia', 145, 'Europa', 1.71],
    ['México', 128, 'America', 1.27]
])
datos_paises

array([['China', '1411', 'Asia', '17.73'],
       ['India', '1367', 'Asia', '3.17'],
       ['Estados Unidos', '331', 'America', '23.32'],
       ['Indonesia', '264', 'Asia', '1.19'],
       ['Pakistan', '233', 'Asia', '0.35'],
       ['Brasil', '212', 'America', '1.83'],
       ['Nigeria', '206', 'Africa', '0.45'],
       ['Bangladesh', '164', 'Asia', '0.32'],
       ['Rusia', '145', 'Europa', '1.71'],
       ['México', '128', 'America', '1.27']], dtype='<U32')

In [16]:
df = pd.DataFrame(datos_paises)
df

                0     1        2      3
0           China  1411     Asia  17.73
1           India  1367     Asia   3.17
2  Estados Unidos   331  America  23.32
3       Indonesia   264     Asia   1.19
4        Pakistan   233     Asia   0.35
5          Brasil   212  America   1.83
6         Nigeria   206   Africa   0.45
7      Bangladesh   164     Asia   0.32
8           Rusia   145   Europa   1.71
9          México   128  America   1.27

In [17]:
#Nombres en columnas
df = pd.DataFrame(datos_paises, columns=['País','Poblacion','Continente','PIB'])
df

             País Poblacion Continente    PIB
0           China      1411       Asia  17.73
1           India      1367       Asia   3.17
2  Estados Unidos       331    America  23.32
3       Indonesia       264       Asia   1.19
4        Pakistan       233       Asia   0.35
5          Brasil       212    America   1.83
6         Nigeria       206     Africa   0.45
7      Bangladesh       164       Asia   0.32
8           Rusia       145     Europa   1.71
9          México       128    America   1.27



---


##APERTURA ARCHIVOS

->>>>> EXCEL
- Pongo ruta y tambien puedo abrir hojas, si tengo más de una.

In [18]:
df = pd.read_excel('Data/abrir_excel.xlsx', sheet_name='Empleados')
df

  Empleado Departamento  Salario
0     Juan       Ventas    50000
1      Ana    Marketing    55000
2     Luis           IT    60000
3    Marta     Finanzas    65000

->>>>> JSON

In [19]:
df = pd.read_json('Data/abrir_json.json')
df

                          Curso  Duración (horas)       Nivel
0     Python para Principiantes                40      Básico
1  Análisis de Datos con Pandas                30  Intermedio
2     Machine Learning Avanzado                60    Avanzado
3         SQL para Data Science                25      Básico

->>>>> CSV

In [21]:
df = pd.read_csv('Data/online_sales_2020-2022.csv', index_col=0)
df

#Está linitado desde el comienzo a 10 filas y columnas none.
#Cunado creo indice, sino especifico, me lo pone por defecto. Fila "Unmamed" debo eliminar pero si ya lo tengo le indico "index_col=0" y lo reemplaza.
#df es una variable, puedo cambiar el nombre a gusto, ej llamarlo "sales" si voy a crear varios sino df para hacer más rapido.

#sales = pd.read_csv('Data/online_sales_2020-2022.csv', index_col=0)
#sales'

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Discount
0,221958,SKU_1964,White Mug,38,2020-01-01 00:00,1.71,37039.0,Australia,0.470000
1,771155,SKU_1241,White Mug,18,2020-01-01 01:00,41.25,19144.0,Spain,0.190000
2,231932,SKU_1501,Headphones,49,2020-01-01 02:00,29.11,50472.0,Germany,0.350000
3,465838,SKU_1760,Desk Lamp,14,2020-01-01 03:00,76.68,96586.0,Netherlands,0.140000
4,359178,SKU_1386,USB Cable,-30,2020-01-01 04:00,-68.11,NaN,United Kingdom,1.501433
...,...,...,...,...,...,...,...,...,...
26299,714639,SKU_1501,White Mug,16,2022-12-31 19:00,92.30,64303.0,Italy,0.470000
26300,411009,SKU_1224,Desk Lamp,46,2022-12-31 20:00,92.88,31181.0,Portugal,0.290000
26301,154457,SKU_1613,Wall Clock,38,2022-12-31 21:00,42.04,40235.0,United States,0.490000
26302,190159,SKU_1098,Wireless Mouse,-15,2022-12-31 22:00,-48.03,NaN,Norway,1.116054
26303,300065,SKU_1306,Desk Lamp,-24,2022-12-31 23:00,-76.69,NaN,Spain,1.235000

## Métodos Básicos de Pandas

* head()

-- Muestra las 5 primeras o el nº que le indique

In [47]:
df.head() #muestra las 10 primeras filas

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Discount
0,221958,SKU_1964,White Mug,38,2020-01-01 00:00,1.71,37039.0,Australia,0.470000
1,771155,SKU_1241,White Mug,18,2020-01-01 01:00,41.25,19144.0,Spain,0.190000
2,231932,SKU_1501,Headphones,49,2020-01-01 02:00,29.11,50472.0,Germany,0.350000
3,465838,SKU_1760,Desk Lamp,14,2020-01-01 03:00,76.68,96586.0,Netherlands,0.140000
4,359178,SKU_1386,USB Cable,-30,2020-01-01 04:00,-68.11,NaN,United Kingdom,1.501433

* tail()

-- Muestra las 5 últimas o el nº que le indique

In [48]:
df.tail()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Discount
26299,714639,SKU_1501,White Mug,16,2022-12-31 19:00,92.30,64303.0,Italy,0.470000
26300,411009,SKU_1224,Desk Lamp,46,2022-12-31 20:00,92.88,31181.0,Portugal,0.290000
26301,154457,SKU_1613,Wall Clock,38,2022-12-31 21:00,42.04,40235.0,United States,0.490000
26302,190159,SKU_1098,Wireless Mouse,-15,2022-12-31 22:00,-48.03,NaN,Norway,1.116054
26303,300065,SKU_1306,Desk Lamp,-24,2022-12-31 23:00,-76.69,NaN,Spain,1.235000

* sample()

-- Muestra fila al azar o el nº que le indique >> es mucho más útil que los anteriores

In [49]:
df.sample(5)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Discount
17432,573875,SKU_1806,Office Chair,48,2021-12-27 08:00,64.18,92995.0,Australia,0.20
22743,383080,SKU_1968,White Mug,21,2022-08-05 15:00,80.16,69413.0,France,0.21
21197,212808,SKU_1323,White Mug,31,2022-06-02 05:00,62.17,22495.0,Sweden,0.39
7525,142674,SKU_1191,Wall Clock,14,2020-11-09 13:00,79.54,22254.0,Sweden,0.21
11533,216603,SKU_1570,USB Cable,25,2021-04-25 13:00,8.67,53793.0,United States,0.28

* shape()

-- Muestra el nº de filas y columnas de DF, me devuelve una tupla.

In [50]:
df.shape
print(f'En nuestro DF tenemos {df.shape[0]} filas y {df.shape[1]} columnas')

En nuestro DF tenemos 26304 filas y 9 columnas

* size()

-- Muestra el nº de celadas que tenemos en total (filas y columas, seria = df.shape[0]*df.shape[1])

In [51]:
df.size

236736

* columns()

-- Muestra lista con el nombre de columas, así no tengo que scrollar

In [52]:
df.columns

Index(['InvoiceNo', 'StockCode', 'Description', 'Quantity', 'InvoiceDate',
       'UnitPrice', 'CustomerID', 'Country', 'Discount'],
      dtype='object')

In [53]:
#Puedo itarar por las columnas para verlas más comodamente.
for col in df.columns:
    print(col)

InvoiceNo
StockCode
Description
Quantity
InvoiceDate
UnitPrice
CustomerID
Country
Discount

* info()

-- Muestra información general >> muy útil hacerlo al principio, ver tipo dato y si hay nulos.

In [54]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 26304 entries, 0 to 26303
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   InvoiceNo    26304 non-null  int64
 1   StockCode    26304 non-null  object
 2   Description  26304 non-null  object
 3   Quantity     26304 non-null  int64
 4   InvoiceDate  26304 non-null  object
 5   UnitPrice    26304 non-null  float64
 6   CustomerID   23753 non-null  float64
 7   Country      26304 non-null  object
 8   Discount     26304 non-null  float64
dtypes: float64(3), int64(2), object(4)
memory usage: 2.0+ MB

* df.dtypes

-- Muestra lo mismo que info pero tipo de dato

In [55]:
df.dtypes

InvoiceNo        int64
StockCode       object
Description     object
Quantity         int64
InvoiceDate     object
UnitPrice      float64
CustomerID     float64
Country         object
Discount       float64
dtype: object

* select_dtypes()

-- Seleccionar ese tipo de dato concreto.

In [59]:
df.select_dtypes(include='object') #solo texto o numerico o fecha
#df.select_dtypes(include='datetime') #solo fecha
#df.select_dtypes(include='number') #solo numerico

      StockCode     Description       InvoiceDate         Country
0      SKU_1964       White Mug  2020-01-01 00:00       Australia
1      SKU_1241       White Mug  2020-01-01 01:00           Spain
2      SKU_1501      Headphones  2020-01-01 02:00         Germany
3      SKU_1760       Desk Lamp  2020-01-01 03:00     Netherlands
4      SKU_1386       USB Cable  2020-01-01 04:00  United Kingdom
...         ...             ...               ...             ...
26299  SKU_1501       White Mug  2022-12-31 19:00           Italy
26300  SKU_1224       Desk Lamp  2022-12-31 20:00        Portugal
26301  SKU_1613      Wall Clock  2022-12-31 21:00   United States
26302  SKU_1098  Wireless Mouse  2022-12-31 22:00          Norway
26303  SKU_1306       Desk Lamp  2022-12-31 23:00           Spain

[26304 rows x 4 columns]

* isnull()

-- Muestra cantidad de nulos

In [60]:
df.isnull()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Discount
0,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,True,False,False
...,...,...,...,...,...,...,...,...,...
26299,False,False,False,False,False,False,False,False,False
26300,False,False,False,False,False,False,False,False,False
26301,False,False,False,False,False,False,False,False,False
26302,False,False,False,False,False,False,True,False,False
26303,False,False,False,False,False,False,True,False,False

In [61]:
df.isnull().sum() #cuenta los nulos por columna

InvoiceNo         0
StockCode         0
Description       0
Quantity          0
InvoiceDate       0
UnitPrice         0
CustomerID     2551
Country           0
Discount          0
dtype: int64

In [63]:
df.isnull().sum().sum() #cuenta los nulos totales
print(f'En nuestro DF tenemos {df.isnull().sum().sum()} nulos totales')

En nuestro DF tenemos 2551 nulos totales

* df.duplicated()

-- Muesta cantidad de valores duplicados, similar al anterior más útil con sum()

In [65]:
df.duplicated().sum() #cuenta los duplicados por fila
print(f'En nuestro DF tenemos {df.duplicated().sum()} duplicados totales')

En nuestro DF tenemos 0 duplicados totales

* describe()

-- Muestra estadisticas principales de las columnas numericas, calcula conteo valores, mediana, desv std, cuartiles, max.

In [66]:
df.describe()

           InvoiceNo      Quantity     UnitPrice    CustomerID      Discount
count   26304.000000  26304.000000  26304.000000  23753.000000  26304.000000
mean   552925.099719     22.541286     47.256332  54917.302530      0.275328
std    259756.484885     17.744803     33.307590  25995.956967      0.228697
min    100005.000000    -50.000000    -99.860000  10003.000000      0.000000
25%    328855.500000     11.000000     23.430000  32469.000000      0.130000
50%    554916.000000     23.000000     48.370000  55085.000000      0.260000
75%    777752.750000     37.000000     74.200000  77326.000000      0.380000
max    999993.000000     49.000000     99.990000  99998.000000      1.998946

In [ ]:
df.describe(include='object') #calcula lo que puede para texto

       StockCode Description       InvoiceDate Country
count      26304       26304             26304   26304
unique      1000          11             26304      12
top     SKU_1944  Wall Clock  2020-01-01 00:00  France
freq          43        2467                 1    2270

* unique()

-- Muestra valores únicos de una columna

In [69]:
df['Country'].unique() #muestra los paises que tengo
#iterar por los paises
for pais in df['Country'].unique():
    print(pais)

Australia
Spain
Germany
Netherlands
United Kingdom
Sweden
Belgium
Norway
Italy
Portugal
France
United States

* value_counts()

#Muestra valores únicos con la frecuencia

In [70]:
df['Country'].value_counts() #cuenta los paises y los muestra por orden de cantidad

Country
France            2270
Sweden            2233
Netherlands       2223
United Kingdom    2216
Germany           2214
                  ...
Italy             2171
United States     2155
Spain             2147
Norway            2146
Belgium           2141
Name: count, Length: 12, dtype: int64